//Напишите программу, выводящую "Hello, World!". Можно скопировать ее из конспекта.
//
//Sample Input:
//
//Sample Output:
//
//Hello, World!

#include <iostream>

using namespace std;

int t00_hello() {
    std::cout << "Hello, World!" << std::endl;
    return 0;
}