//Отсортируйте массив.
//
//Входные данные
//
//Первая строка входных данных содержит количество элементов в массиве N ≤ 10^5. 
// Далее идет N целых чисел, не превосходящих по абсолютной величине 10^9.
//
//Выходные данные
//
//Выведите эти числа в порядке неубывания.
//
//Sample Input:
//
//5
//5 4 3 2 1
//Sample Output:
//
//1 2 3 4 5

#include "t01_sort.h"
#include <iostream>


using namespace std;
void sortArray(int array[],int length) {
    for (int i = 0; i < length; i++) {
        for (int j = 0; j < length - 1 - i; j++) {
            if (array[j] > array[j + 1]) {
                int temp = array[j];
                array[j] = array[j + 1];
                array[j + 1] = temp;
            }
        }
    }
}
int t01_sort() {
    int length,n;
    cin>>length;
    int array[length];
    for(int i=0 ; i<length ; i++){
        cin>>n;
        array[i]=n;
    }
    sortArray(array, length);
    for(int i=0 ; i<length ; i++){
        cout<<array[i]<<" ";
    }
    return 0;    
}
