//По данному целому числу N распечатайте все квадраты натуральных чисел, не превосходящие N, в порядке возрастания.
//
//Формат входных данных
//        Вводится натуральное число.
//
//Формат выходных данных
//        Выведите ответ на задачу.
//
//Sample Input:
//
//50
//Sample Output:
//
//1 4 9 16 25 36 49

#include "t01_quad.h"
#include <iostream>

using namespace std;

int t01_quad() {
    int a , b , i ;
    cin >> a ;
    i = 1;
    b = i*i ;
    while ( b <= a ) {
        cout << b << " ";
        i++;
        b = i * i;
    }
        return 0 ;
};