//Вводится один символ, измените его регистр. 
// То есть, если была введена строчная буква - сделайте ее заглавной и наоборот. 
// Символы, не являющиеся латинской буквой, нужно выводить без изменений.
//
//Входные данные
//
//Вводится единственый символ.
//
//Выходные данные
//
//Выведите ответ на задачу.
//
//Sample Input:
//
//b
//        Sample Output:
//
//B

#include "t03_toggle.h"
#include <iostream>


using namespace std;

int t03_toggle() {
	char up;
	cin >> up;
	if (up <= 122 && up >= 97) cout << (char)(up - 32);
	else if (up <= 90 && up >= 65) cout << (char)(up + 32);
	else cout << up;
	return 0;

}
