//Дан двумерный массив и два числа: i и j. Поменяйте в массиве столбцы с номерами i и j
//        Формат входных данных
//Программа получает на вход размеры массива n и m, не превосходящие 100, 
// затем элементы массива, затем числа i и j.
//Формат выходных данных
//        Выведите результат.
//
//Sample Input:
//
//3 4
//11 12 13 14
//21 22 23 24
//31 32 33 34
//0 1
//Sample Output:
//
//12 11 13 14
//22 21 23 24
//32 31 33 34

#include "t04_swap.h"
#include <iostream>


using namespace std;

int t04_swap() {
	int n = 0, m = 0, c = 0, i = 0, j = 0;
	cin >> n >> m;
	int a[n][m] = { 0 };
	for (int a1 = 0; a1 < n; a1++)
	{
		for (int b1 = 0; b1 < m; b1++) 
		{
			cin >> a[a1][b1];
		}
	}
	cin >> i >> j;
	for (int a1 = 0; a1 < n; a1++) 
	{
		c = a[a1][i];
		a[a1][i] = a[a1][j];
		a[a1][j] = c;
	}
	for (int a1 = 0; a1 < n; a1++)
	{
		for (int b1 = 0; b1 < m; b1++)
		{
			cout << a[a1][b1] << " ";
		}
	}
    return 0;
}
