//Шахматный ферзь ходит по диагонали, горизонтали или вертикали. Даны две различные клетки шахматной доски, определите, может ли ферзь попасть с первой клетки на вторую одним ходом.
//
//Формат входных данных
//        Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки.
//Формат выходных данных
//        Программа должна вывести YES, если из первой клетки ходом ферзя можно попасть во вторую или NO в противном случае.
//Sample Input 1:
//
//1
//1
//2
//2
//Sample Output 1:
//
//YES
//        Sample Input 2:
//
//1
//1
//2
//3
//Sample Output 2:
//
//NO

#include "t07_chess_queen.h"
#include <iostream>

using namespace std;

int t07_chess_queen() {
    int h,v,H,V;
    cin >> h >> v >> H >> V;
    if ( (H==h-1&&V==v-1)||(H==h+1&&V==v+1)||(H==h-1&&V==v+1)||(H==h+1&&V==v-1)||(H==h-2&&V==v-2)||(H==h+2&&V==v+2)||(H==h-2&&V==v+2)||(H==h+2&&V==v-2)||(H==h-3&&V==v-3)||(H==h+3&&V==v+3)||(H==h-3&&V==v+3)||(H==h+3&&V==v-3)||(H==h-4&&V==v-4)||(H==h+4&&V==v+4)||(H==h-4&&V==v+4)||(H==h+4&&V==v-4)||(H==h-5&&V==v-5)||(H==h+5&&V==v+5)||(H==h-5&&V==v+5)||(H==h+5&&V==v-5)||(H==h-6&&V==v-6)||(H==h+6&&V==v+6)||(H==h-6&&V==v+6)||(H==h+6&&V==v-6)||(H==h-7&&V==v-7)||(H==h+7&&V==v+7)||(H==h-7&&V==v+7)||(H==h+7&&V==v-7)||(h<=H&&v==V)||(h>=H&&v==V)||(h==H&&v>=V)||(h==H&&v<=V) ) {
      cout << "YES";
    }
    else {
        cout << "NO";
    }
    return 0;
}