//В сети интернет каждому компьютеру присваивается четырехбайтовый код, 
// который принято записывать в виде четырех чисел, 
// каждое из которых может принимать значения от 0 до 255, разделенных точками.
// Вот примеры правильных IP-адресов:
//127.0.0.0
//192.168.0.1
//255.0.255.255
//Напишите программу, которая определяет, является ли заданная строка правильным IP-адресом.
//
//Входные данные
//
//Программа получает на вход строку из произвольных символов.
//
//Выходные данные
//
//Если эта строка является корректной записью IP-адреса, выведите YES, иначе выведите NO.
//
//Примечание
//
//Для перевода из строки в число удобно пользоваться функцией stoi,
// которая принимает на вход строку, а возвращает число.
//
//Sample Input:
//
//127.0.0.1
//Sample Output:
//
//YES

#include "t07_ip.h"
#include <iostream>


using namespace std;

int t07_ip() {
int w1,w2,w3,w4;
bool n=(cin>>w1) && cin.get()=='.' &&(cin>>w2) && cin.get()=='.' &&(cin>>w3) && cin.get()=='.' &&(cin>>w4) &&w1>=0 && w1<256 &&w2>=0 && w2<256 && w3>=0 && w3<256 &&w4>=0 && w4<256;
if (w2<w4){cout<<"NO";return 0;}
cout<<(n?"YES":"NO");
return 0;
}
