//В сети интернет каждому компьютеру присваивается четырехбайтовый код, 
// который принято записывать в виде четырех чисел, 
// каждое из которых может принимать значения от 0 до 255, разделенных точками.
// Вот примеры правильных IP-адресов:
//127.0.0.0
//192.168.0.1
//255.0.255.255
//Напишите программу, которая определяет, является ли заданная строка правильным IP-адресом.
//
//Входные данные
//
//Программа получает на вход строку из произвольных символов.
//
//Выходные данные
//
//Если эта строка является корректной записью IP-адреса, выведите YES, иначе выведите NO.
//
//Примечание
//
//Для перевода из строки в число удобно пользоваться функцией stoi,
// которая принимает на вход строку, а возвращает число.
//
//Sample Input:
//
//127.0.0.1
//Sample Output:
//
//YES

#include "t07_ip.h"
#include <iostream>


using namespace std;

int t07_ip() {
  int x1,x2,x3,x4;
    bool res=(cin>>x1) && cin.get()=='.' &&
            (cin>>x2) && cin.get()=='.' &&
            (cin>>x3) && cin.get()=='.' &&
            (cin>>x4) &&
            x1>=0 && x1<256 &&
            x2>=0 && x2<256 &&
            x3>=0 && x3<256 &&
            x4>=0 && x4<256;
    cout<<(res?"YES":"NO");
}
