//По данным числам n и m заполните двумерный массив размером n×m числами от 1 до n×m по спирали, выходящей из левого верхнего угла и закрученной по часовой стрелке, как показано в примере.
//Формат входных данных
//        Вводятся два числа n и m, не превышающие 100.
//
//Формат выходных данных
//        Выведите полученный массив, отводя на вывод каждого элемента ровно 4 символа.
//
//Sample Input:
//
//4 5
//Sample Output:
//
//   1   2   3   4   5
//  14  15  16  17   6
//  13  20  19  18   7
//  12  11  10   9   8

#include "t09_spiral.h"
#include <iostream>
#include <iomanip>


using namespace std;

int t09_spiral() {
    int n,m,k=1,i=0,j=1;
    cin >> n >> m;
    int a[101][101];
    for (int l = 0; l < n; ++l) {
        for (int p = 0; p < m; ++p) {
            a[l][p]=-1;
        }
    }
    a[0][0]=k++;
    while (k<=n*m) {
        if (a[i][j-1] == k-1 && a[i][j]==-1){
           a[i][j]=k++;
           j++;
        }
        if (a[i][j-1] == k-1 && a[i][j]!=-1){
            j--;
            i++;
        }
        if (a[i-1][j] == k-1 && a[i][j]==-1){
            a[i][j]=k++;
            i++;
        }
        if (a[i-1][j] == k-1 && a[i][j]!=-1){
            j--;
            i--;
        }
        if (a[i][j+1] == k-1 && a[i][j]==-1){
            a[i][j]=k++;
            j--;
        }
        if (a[i][j+1] == k-1 && a[i][j]!=-1){
            j++;
            i--;
        }
        if (a[i+1][j] == k-1 && a[i][j]==-1){
            a[i][j]=k++;
            i--;
        }
        if (a[i+1][j] == k-1 && a[i][j]!=-1){
            j++;
            i++;
        }
    }
    for (int i = 0; i < n; ++i) {
        for (int j = 0; j < m; ++j) {
            cout << setw(4) << a[i][j] ;
        }
        cout << endl;
    }
    return 0;
}
