//По данным числам n и m заполните двумерный массив размером n×m числами от 1 до n×m по спирали, выходящей из левого верхнего угла и закрученной по часовой стрелке, как показано в примере.
//Формат входных данных
//        Вводятся два числа n и m, не превышающие 100.
//
//Формат выходных данных
//        Выведите полученный массив, отводя на вывод каждого элемента ровно 4 символа.
//
//Sample Input:
//
//4 5
//Sample Output:
//
//   1   2   3   4   5
//  14  15  16  17   6
//  13  20  19  18   7
//  12  11  10   9   8

#include "t09_spiral.h"
#include <iostream>
#include <iomanip>


using namespace std;

int t09_spiral() {
	int n, m, s = 0, u = 0, d = 0, l = 0, r = 0, i = 0, j = 0;
	int a[100][100];

	cin >> n >> m;
	for (int l = 0; l < n; l++) {
		for (int p = 0; p < m; p++) {
			a[l][p] = 0;
		}
	}
	while (u == 0 || d == 0 || l == 0 || r == 0) {

		//r
		while (r == 0) {
			if (a[i][j] == 0 && j < m && i < n) {
				s++;
				a[i][j] = s;
				j++;
			}
			else {
				r = 1;
				i++;
				j--;
			}
		}
		if (a[i][j] == 0) {
			d = 0;

		}


		//d
		while (d == 0) {
			if (a[i][j] == 0 && i < n && j<m) {
				s++;
				a[i][j] = s;
				i++;
			}
			else {
				d = 1;
				i--;
				j--;
			}
		}
		if (a[i][j] == 0) {
			l = 0;

		}
		//l
		while (l == 0) {
			if (a[i][j] == 0 && j >= 0 && i >=0) {
				s++;
				a[i][j] = s;
				j--;
			}
			else {
				l = 1;
				i--;
				j++;
			}
		}
		if (a[i][j] == 0) {
			u = 0;
		}
		while (u == 0) {
			if (a[i][j] == 0 && i >= 0 && j >=0) {
				s++;
				a[i][j] = s;
				i--;
			}
			else {
				u = 1;
				j++;
				i++;
			}
		}
		if (a[i][j] == 0)
			r = 0;

	}

	for (int i = 0;i < n;i++) {
		for (int j = 0; j < m; j++) {

			cout << setw(4) << a[i][j] << " ";
		}
		
	}
    return 0;
}
