//Элемент последовательности называется локальным максимумом, если он строго больше предыдущего и последующего элемента последовательности. Первый и последний элемент последовательности не являются локальными максимумами.
//
//Дана последовательность натуральных чисел, завершающаяся числом 0. Определите количество строгих локальных максимумов в этой последовательности.
//
//Формат входных данных
//        Вводится последовательность натуральных чисел, оканчивающаяся числом 0 (само число 0 в последовательность не входит, а служит как признак ее окончания).
//Формат выходных данных
//        Выведите ответ на задачу.
//Sample Input:
//
//1
//2
//1
//2
//1
//0
//Sample Output:
//
//2

#include "t10_max_local.h"
#include <iostream>

using namespace std;

int t10_max_local() {
	int c = 0, m1 = 0, m2 = 0, m3 = 0;
	cin >> m1 >> m2 >> m3;
	while (m3 != 0)
	{
		if (m2 > m1&& m2 > m3&& m3 != 0) { c++; }
		m1 = m2; m2 = m3; cin >> m3;
	
	}
	cout << c;
};