//Известно, что на доске 8×8 можно расставить 8 ферзей так, чтобы они не били друг друга. Вам дана расстановка 8 ферзей на доске, определите, есть ли среди них пара бьющих друг друга.
//Формат входных данных
//
//        Программа получает на вход восемь пар чисел, каждое число от 1 до 8 - координаты 8 ферзей.
//Формат выходных данных
//        Если ферзи не бьют друг друга, выведите слово NO, иначе выведите YES.
//Sample Input 1:
//
//1 7
//2 4
//3 2
//4 8
//5 6
//6 1
//7 3
//8 5
//Sample Output 1:
//
//NO
//        Sample Input 2:
//
//1 8
//2 7
//3 6
//4 5
//5 4
//6 3
//7 2
//8 1
//Sample Output 2:
//
//YES

#include "t11_queen.h"
#include <iostream>
#include <cmath>


using namespace std;

int t11_queen() {
    int N = 16;
    int p[N];
    bool f = false;
    for (int i=0; i<N; i++){
        cin >>p[i];
    }
    for (int i=0, j=1, u=1; i<N and j<N; i=i+2, j=j+2, u++){
        for (int k=u+1; k<8; k++){
            if ((p[i] == p[(i+((k-u)*2))] and (p[j] != p[j+((k-u)*2)])) or ((p[i] != p[i+((k-u)*2)]) and (p[j] == p[j+((k-u)*2)])) or ((p[i] ==p[i+((k-u)*2)]) and (p[j]==p[j+((k-u)*2)])) or ((p[i] - p[i+((k-u)*2)]) == (p[j] - p[j+((k-u)*2)])) or ((p[i] - p[i+((k-u)*2)]) == -(p[j] - p[j+((k-u)*2)]))) {
                f = true;
            }
        }
    }
    if (!f) {
        cout <<"NO";
    }
    if (f) {
        cout <<"YES";
    }
    return 0;
}